Revit 2024 API
ExternalResourceLoadContent Members
The ExternalResourceLoadContent type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ExternalResourceLoadContent
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LoadStatus
 A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method.
Version
 The version of the external data that the server is providing in this object.
See Also
ExternalResourceLoadContent Class
Autodesk.Revit.DB Namespace